算术运算和数据对齐

In [1]:
import numpy as np
import pandas as pd

In [2]:
s1=pd.Series([7.3,-2.5,3.4,1.5],index=['a','c','d','e'])
s2=pd.Series([-2.1,3.6,-1.5,4,3.1],index=['a','c','e','f','g'])

In [3]:
s1,s2

(a    7.3
 c   -2.5
 d    3.4
 e    1.5
 dtype: float64, a   -2.1
 c    3.6
 e   -1.5
 f    4.0
 g    3.1
 dtype: float64)

In [4]:
s1+s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

只有index对齐的可以相加，否则为NaN

对于DataFrame类似，对齐操作会发生在行和列上

In [6]:
df1=pd.DataFrame(np.arange(9.).reshape((3,3)),index=['Ohio','Texas','Colorado'])
df2=pd.DataFrame(np.arange(12.).reshape((4,3)),index=['Utah','Ohio','Texas','Oregon'])

In [7]:
df1,df2

(            0    1    2
 Ohio      0.0  1.0  2.0
 Texas     3.0  4.0  5.0
 Colorado  6.0  7.0  8.0,           0     1     2
 Utah    0.0   1.0   2.0
 Ohio    3.0   4.0   5.0
 Texas   6.0   7.0   8.0
 Oregon  9.0  10.0  11.0)

In [8]:
df1+df2

            0     1     2
Colorado  NaN   NaN   NaN
Ohio      3.0   5.0   7.0
Oregon    NaN   NaN   NaN
Texas     9.0  11.0  13.0
Utah      NaN   NaN   NaN

In [9]:
np.nan

nan

In [11]:
df1.add(df2,fill_value=0)

            0     1     2
Colorado  6.0   7.0   8.0
Ohio      3.0   5.0   7.0
Oregon    9.0  10.0  11.0
Texas     9.0  11.0  13.0
Utah      0.0   1.0   2.0

In [12]:
frame=pd.DataFrame(np.arange(12.).reshape((4,3)),columns=list('bde'),index=['Utah','Ohio','Texas','Oregon'])

In [13]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [16]:
series=frame.iloc[0]
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [20]:
series=frame['d']
series

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [22]:
obj=pd.Series(range(4),index=['d','a','b','c'])
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [25]:
obj=obj.sort_index()
obj

a    1
b    2
c    3
d    0
dtype: int64

In [27]:
obj.sort_values()

d    0
a    1
b    2
c    3
dtype: int64

In [3]:
frame=pd.DataFrame(np.arange(8).reshape((2,4)),index=['three','one'],columns=['d','a','b','c'])
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [29]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [32]:
frame.sort_values(by='d')

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [8]:
frame.rank()

         d    a    b    c
three  1.0  1.0  1.0  1.0
one    2.0  2.0  2.0  2.0

In [12]:
frame.rank(method='max',ascending=False)

         d    a    b    c
three  2.0  2.0  2.0  2.0
one    1.0  1.0  1.0  1.0

In [15]:
!cat ex1.csv

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [16]:
df=pd.read_csv('ex1.csv')

In [17]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [18]:
pd.read_table('ex1.csv',sep=',')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [19]:
!cat examples/ex2.csv

1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [20]:
pd.read_csv('examples/ex2.csv',header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [24]:
pd.read_csv('examples/ex2.csv',names=['a','b','c','d','message'])#用names自定义列名

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [22]:
names=['a','b','c','d','message']

In [23]:
pd.read_csv('examples/ex2.csv',names=names,index_col='message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [25]:
!cat examples/csv_mindex.csv

key1,key2,value1,value2
one,a,1,2
one,b,3,4
one,c,5,6
one,d,7,8
two,a,9,10
two,b,11,12
two,c,13,14
two,d,15,16

In [26]:
parsed=pd.read_csv('examples/csv_mindex.csv',index_col=['key1','key2'])
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [27]:
list(open('examples/ex3.txt'))

['            A         B         C\n',
 'aaa -0.264438 -1.026059 -0.619500\n',
 'bbb  0.927272  0.302904 -0.032399\n',
 'ccc -0.264273 -0.386314 -0.217601\n',
 'ddd -0.871858 -0.348382  1.100491\n']

In [28]:
result=pd.read_table('examples/ex3.txt')
result

               A         B         C
0  aaa -0.264438 -1.026059 -0.619500
1  bbb  0.927272  0.302904 -0.032399
2  ccc -0.264273 -0.386314 -0.217601
3  ddd -0.871858 -0.348382  1.100491

In [30]:
result=pd.read_csv('examples/ex3.txt',sep='\s+')
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [31]:
!cat examples/ex4.csv

# hey!
a,b,c,d,message
# just wanted to make things more difficult for you
# who reads CSV files with computers, anyway?
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [32]:
pd.read_csv('examples/ex4.csv',skiprows=[0,2,3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [33]:
!cat examples/ex5.csv

something,a,b,c,d,message
one,1,2,3,4,NA
two,5,6,,8,world
three,9,10,11,12,foo

In [34]:
result=pd.read_csv('examples/ex5.csv')
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [35]:
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [36]:
sentinels={'message':['foo','NA'],'something':['two']}

In [37]:
pd.read_csv('examples/ex5.csv',na_values=sentinels)#按字典转化为nan

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

path表示文件系统位置、URL、文件型对象的字符串
sep或delimiter用于对行中各字段进行拆分的字符序列或正则表达式
header用作列名的行号。默认为0（第一行），如果没有
header行就应该设置为None 
index_col 用作行索引的列编号或列名。可以是单个名称/数字或由多个名称/数字组成的列表（层次化索引）
names用于结果的列名列表，结合header=None 
skiprows需要忽略的行数（从文件开始处算起），或需要跳过的行号列表（从0开始）
na_values一组用于替换NA的值
comment用于将注释信息从行尾拆分出去的字符（一个或多个）

chunksize逐块读取文件

In [38]:
data=pd.read_csv('examples/ex5.csv')
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [39]:
data.to_csv('examples/out.csv')

In [40]:
!cat examples/out.csv

,something,a,b,c,d,message
0,one,1,2,3.0,4,
1,two,5,6,,8,world
2,three,9,10,11.0,12,foo

In [2]:
data=pd.read_json('examples/example.json')
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [4]:
print(data.to_json())

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}

In [5]:
print(data.to_json(orient='records'))

[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":7,"b":8,"c":9}]

In [6]:
tables=pd.read_html('examples/fdic_failed_bank_list.html')

In [7]:
tables

[                                  Bank Name             City  ST   CERT  \
 0                               Allied Bank         Mulberry  AR     91
 1              The Woodbury Banking Company         Woodbury  GA  11297
 2                    First CornerStone Bank  King of Prussia  PA  35312
 3                        Trust Company Bank          Memphis  TN   9956
 4                North Milwaukee State Bank        Milwaukee  WI  20364
 5                    Hometown National Bank         Longview  WA  35156
 6                       The Bank of Georgia   Peachtree City  GA  35259
 7                              Premier Bank           Denver  CO  34112
 8                            Edgebrook Bank          Chicago  IL  57772
 9                    Doral Bank  En Espanol         San Juan  PR  32102
 10        Capitol City Bank & Trust Company          Atlanta  GA  33938
 11                  Highland Community Bank          Chicago  IL  20290
 12         First National Bank of Crestview        Crestview  FL  17557
 13                       Northern Star Bank          Mankato  MN  34983
 14   Frontier Bank, FSB D/B/A El Paseo Bank      Palm Desert  CA  34738
 15    The National Republic Bank of Chicago          Chicago  IL    916
 16                           NBRS Financial       Rising Sun  MD   4862
 17                    GreenChoice Bank, fsb          Chicago  IL  28462
 18                 Eastside Commercial Bank          Conyers  GA  58125
 19                   The Freedom State Bank          Freedom  OK  12483
 20                              Valley Bank  Fort Lauderdale  FL  21793
 21                              Valley Bank           Moline  IL  10450
 22              Slavie Federal Savings Bank          Bel Air  MD  32368
 23                    Columbia Savings Bank       Cincinnati  OH  32284
 24             AztecAmerica Bank En Espanol           Berwyn  IL  57866
 25                    Allendale County Bank          Fairfax  SC  15062
 26                       Vantage Point Bank          Horsham  PA  58531
 27    Millennium Bank, National Association         Sterling  VA  35096
 28                             Syringa Bank            Boise  ID  34296
 29                        The Bank of Union          El Reno  OK  17967
 ..                                      ...              ...  ..    ...
 517                       ANB Financial, NA      Bentonville  AR  33901
 518                               Hume Bank             Hume  MO   1971
 519                  Douglass National Bank      Kansas City  MO  24660
 520                       Miami Valley Bank         Lakeview  OH  16848
 521                                 NetBank       Alpharetta  GA  32575
 522               Metropolitan Savings Bank       Pittsburgh  PA  35353
 523                         Bank of Ephraim          Ephraim  UT   1249
 524                           Reliance Bank     White Plains  NY  26778
 525   Guaranty National Bank of Tallahassee      Tallahassee  FL  26838
 526                     Dollar Savings Bank           Newark  NJ  31330
 527                    Pulaski Savings Bank     Philadelphia  PA  27203
 528   First National Bank of Blanchardville   Blanchardville  WI  11639
 529                   Southern Pacific Bank         Torrance  CA  27094
 530             Farmers Bank of Cheneyville      Cheneyville  LA  16445
 531                           Bank of Alamo            Alamo  TN   9961
 532  AmTrade International Bank  En Espanol          Atlanta  GA  33784
 533          Universal Federal Savings Bank          Chicago  IL  29355
 534            Connecticut Bank of Commerce         Stamford  CT  19183
 535                        New Century Bank  Shelby Township  MI  34979
 536                   Net 1st National Bank       Boca Raton  FL  26652
 537                            NextBank, NA          Phoenix  AZ  22314
 538                Oakwood Deposit Bank Co.          Oakwood  OH   8966
 539                   Bank of Sierra Blanca    Sierra Blanca  TX  22002
 540           Hamilton Bank, NA  En Espanol            Miami  FL  24382
 541                  Sinclair National Bank         Gravette  AR  34248
 542                      Superior Bank, FSB         Hinsdale  IL  32646
 543                     Malta National Bank            Malta  OH   6629
 544         First Alliance Bank & Trust Co.       Manchester  NH  34264
 545       National State Bank of Metropolis       Metropolis  IL   3815
 546                        Bank of Honolulu         Honolulu  HI  21029

                    Acquiring Institution        Closing Date  \
 0                           Today's Bank  September 23, 2016
 1                            United Bank     August 19, 2016
 2    First-Citizens Bank & Trust Company         May 6, 2016
 3             The Bank of Fayette County      April 29, 2016
 4    First-Citizens Bank & Trust Company      March 11, 2016
 5                         Twin City Bank     October 2, 2015
 6                          Fidelity Bank     October 2, 2015
 7              United Fidelity Bank, fsb       July 10, 2015
 8               Republic Bank of Chicago         May 8, 2015
 9           Banco Popular de Puerto Rico   February 27, 2015
 10   First-Citizens Bank & Trust Company   February 13, 2015
 11             United Fidelity Bank, fsb    January 23, 2015
 12                        First NBC Bank    January 16, 2015
 13                             BankVista   December 19, 2014
 14     Bank of Southern California, N.A.    November 7, 2014
 15                   State Bank of Texas    October 24, 2014
 16                           Howard Bank    October 17, 2014
 17                  Providence Bank, LLC       July 25, 2014
 18             Community & Southern Bank       July 18, 2014
 19       Alva State Bank & Trust Company       June 27, 2014
 20   Landmark Bank, National Association       June 20, 2014
 21                   Great Southern Bank       June 20, 2014
 22                         Bay Bank, FSB        May 30, 2014
 23             United Fidelity Bank, fsb        May 23, 2014
 24              Republic Bank of Chicago        May 16, 2014
 25                   Palmetto State Bank      April 25, 2014
 26                     First Choice Bank   February 28, 2014
 27                  WashingtonFirst Bank   February 28, 2014
 28                          Sunwest Bank    January 31, 2014
 29                             BancFirst    January 24, 2014
 ..                                   ...                 ...
 517       Pulaski Bank and Trust Company         May 9, 2008
 518                        Security Bank       March 7, 2008
 519       Liberty Bank and Trust Company    January 25, 2008
 520         The Citizens Banking Company     October 4, 2007
 521                           ING DIRECT  September 28, 2007
 522  Allegheny Valley Bank of Pittsburgh    February 2, 2007
 523                        Far West Bank       June 25, 2004
 524                     Union State Bank      March 19, 2004
 525              Hancock Bank of Florida      March 12, 2004
 526                          No Acquirer   February 14, 2004
 527                       Earthstar Bank   November 14, 2003
 528                        The Park Bank         May 9, 2003
 529                            Beal Bank    February 7, 2003
 530            Sabine State Bank & Trust   December 17, 2002
 531                          No Acquirer    November 8, 2002
 532                          No Acquirer  September 30, 2002
 533               Chicago Community Bank       June 27, 2002
 534                   Hudson United Bank       June 26, 2002
 535                          No Acquirer      March 28, 2002
 536                       Bank Leumi USA       March 1, 2002
 537                          No Acquirer    February 7, 2002
 538       The State Bank & Trust Company    February 1, 2002
 539     The Security State Bank of Pecos    January 18, 2002
 540     Israel Discount Bank of New York    January 11, 2002
 541                   Delta Trust & Bank   September 7, 2001
 542                Superior Federal, FSB       July 27, 2001
 543                    North Valley Bank         May 3, 2001
 544  Southern New Hampshire Bank & Trust    February 2, 2001
 545              Banterra Bank of Marion   December 14, 2000
 546                   Bank of the Orient    October 13, 2000

            Updated Date
 0     November 17, 2016
 1     November 17, 2016
 2     September 6, 2016
 3     September 6, 2016
 4         June 16, 2016
 5        April 13, 2016
 6      October 24, 2016
 7       August 17, 2016
 8         July 12, 2016
 9          May 13, 2015
 10       April 21, 2015
 11       April 21, 2015
 12     January 15, 2016
 13      January 6, 2016
 14    November 10, 2016
 15      January 6, 2016
 16       March 26, 2015
 17        July 28, 2015
 18        July 11, 2016
 19       March 25, 2016
 20        June 29, 2015
 21        June 26, 2015
 22        June 15, 2015
 23    November 10, 2016
 24     October 20, 2016
 25        July 18, 2014
 26        March 3, 2015
 27       March 03, 2015
 28       April 12, 2016
 29       March 25, 2016
 ..                  ...
 517     August 28, 2012
 518     August 28, 2012
 519    October 26, 2012
 520  September 12, 2016
 521     August 28, 2012
 522    October 27, 2010
 523       April 9, 2008
 524       April 9, 2008
 525        June 5, 2012
 526       April 9, 2008
 527       July 22, 2005
 528        June 5, 2012
 529    October 20, 2008
 530    October 20, 2004
 531      March 18, 2005
 532  September 11, 2006
 533       April 9, 2008
 534   February 14, 2012
 535      March 18, 2005
 536       April 9, 2008
 537    February 5, 2015
 538    October 25, 2012
 539    November 6, 2003
 540  September 21, 2015
 541   February 10, 2004
 542     August 19, 2014
 543   November 18, 2002
 544   February 18, 2003
 545      March 17, 2005
 546      March 17, 2005

 [547 rows x 7 columns]]

In [10]:
len(tables)

1

In [11]:
failures=tables[0]
failures.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"

In [12]:
next=tables[1]

IndexError: list index out of range

按年份计算倒闭的银行数目

In [13]:
close_timestamps=pd.to_datetime(failures['Closing Date'])
close_timestamps.dt.year.value_counts()

2010    157
2009    140
2011     92
2012     51
2008     25
2013     24
2014     18
2002     11
2015      8
2016      5
2004      4
2001      4
2007      3
2003      3
2000      2
Name: Closing Date, dtype: int64

In [18]:
close_timestamps.dt.month.value_counts()

7     74
10    58
4     58
1     49
2     44
8     41
5     41
3     39
9     38
6     36
11    35
12    34
Name: Closing Date, dtype: int64

解析xml
使用objectify得到root
text用root.text得到
属性由root.get得到

In [19]:
from lxml import objectify
from io import StringIO
tag='<a href="http://www. google. com">Google</a>'
root=objectify.parse(StringIO(tag)).getroot()

In [20]:
root

In [21]:
root.get('href')

'http://www. google. com'

In [22]:
root.text

'Google'

二进制数据
利用python内置的pickle序列化
pickle仅建议短期存储，很难保证格式永远稳定

In [25]:
frame=pd.read_csv('examples/ex1.csv')
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [26]:
frame.to_pickle('examples/frame_pickle')

In [27]:
pd.read_pickle('examples/frame_pickle')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

HDF5格式：存储大规模科学数据

In [32]:
frame=pd.DataFrame({'a':np.random.randn(100)})
frame

           a
0  -0.801806
1  -0.089034
2  -0.876829
3  -0.479526
4   0.121374
5   0.898605
6   0.112564
7  -0.342286
8   0.916493
9   2.085483
10  1.918156
11 -1.052471
12  0.730236
13 -0.559314
14  0.405556
15 -1.823746
16 -0.485676
17  1.276259
18 -0.497678
19  0.235278
20  1.153496
21 -2.721729
22  0.489774
23  0.818645
24  0.773505
25  0.815231
26  0.644954
27  0.757695
28  0.702548
29 -0.312188
..       ...
70 -1.638036
71 -0.235510
72 -1.496796
73  0.321242
74 -0.155742
75  0.189121
76 -1.609042
77  0.297785
78  0.467366
79 -0.520738
80 -0.948492
81  0.664659
82 -0.884875
83 -0.384132
84  0.655171
85 -1.922855
86 -0.177057
87 -0.316617
88  1.031991
89 -1.249486
90  0.919871
91 -0.534177
92 -0.038636
93 -0.155329
94  1.299377
95 -0.750961
96  1.430750
97 -0.611404
98 -1.526384
99 -1.107719

[100 rows x 1 columns]

In [33]:
store=pd.HDFStore('mydata.h5')

In [34]:
store['obj1']=frame

In [35]:
store['obj1_col']=frame['a']

In [36]:
store

<class 'pandas.io.pytables.HDFStore'>
File path: mydata.h5

HDF5中的数据在获取时可以通过类似字典的方式获取

In [37]:
store['obj1']

           a
0  -0.801806
1  -0.089034
2  -0.876829
3  -0.479526
4   0.121374
5   0.898605
6   0.112564
7  -0.342286
8   0.916493
9   2.085483
10  1.918156
11 -1.052471
12  0.730236
13 -0.559314
14  0.405556
15 -1.823746
16 -0.485676
17  1.276259
18 -0.497678
19  0.235278
20  1.153496
21 -2.721729
22  0.489774
23  0.818645
24  0.773505
25  0.815231
26  0.644954
27  0.757695
28  0.702548
29 -0.312188
..       ...
70 -1.638036
71 -0.235510
72 -1.496796
73  0.321242
74 -0.155742
75  0.189121
76 -1.609042
77  0.297785
78  0.467366
79 -0.520738
80 -0.948492
81  0.664659
82 -0.884875
83 -0.384132
84  0.655171
85 -1.922855
86 -0.177057
87 -0.316617
88  1.031991
89 -1.249486
90  0.919871
91 -0.534177
92 -0.038636
93 -0.155329
94  1.299377
95 -0.750961
96  1.430750
97 -0.611404
98 -1.526384
99 -1.107719

[100 rows x 1 columns]

In [46]:
store['obj1'][:1]

          a
0 -0.801806

In [38]:
store.put('obj2',frame,format='table')

In [39]:
store.select('obj2',where=['index >= 10 and index <= 15'])

           a
10  1.918156
11 -1.052471
12  0.730236
13 -0.559314
14  0.405556
15 -1.823746

In [47]:
store.close()

store.put('obj1',frame)等价于store['obj1']=frame

HDFStore分为两种存储模式：'fixed'和‘table’
table更慢，但是支持许多特殊语法的查询操作（where）

In [48]:
frame.to_hdf('mydata.h5','obj3',format='table')

In [49]:
xlsx=pd.ExcelFile('examples/ex1.xlsx')

In [50]:
xlsx

In [51]:
print(xlsx)

<pandas.io.excel.ExcelFile object at 0x0000023FB70F2550>

In [52]:
pd.read_excel(xlsx,'Sheet1')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [54]:
frame=pd.read_excel('examples/ex1.xlsx','Sheet1')
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

读取多个表单ExcelFile更快，也可以利用pd.read_excel直接读取表单的名称

写入Excel：创建ExcelWriter，再使用pandas的to_excel方法将数据写入其中
或直接传递文件路径到to_excel

In [55]:
writer=pd.ExcelWriter('examples/ex2.xlsx')

In [56]:
frame.to_excel(writer,'Sheet1')

In [57]:
writer.save()

In [58]:
result=pd.read_excel('examples/ex2.xlsx','Sheet1')
result

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [59]:
frame.to_excel('examples/ex2.xlsx')

In [60]:
import requests
url='https://api.github.com/repos/pandas-dev/pandas/issues'
resp=requests.get(url)
resp

In [61]:
data=resp.json()

In [65]:
data[0]

{'url': 'https://api.github.com/repos/pandas-dev/pandas/issues/27157',
 'repository_url': 'https://api.github.com/repos/pandas-dev/pandas',
 'labels_url': 'https://api.github.com/repos/pandas-dev/pandas/issues/27157/labels{/name}',
 'comments_url': 'https://api.github.com/repos/pandas-dev/pandas/issues/27157/comments',
 'events_url': 'https://api.github.com/repos/pandas-dev/pandas/issues/27157/events',
 'html_url': 'https://github.com/pandas-dev/pandas/pull/27157',
 'id': 462472311,
 'node_id': 'MDExOlB1bGxSZXF1ZXN0MjkzMTUwNDIx',
 'number': 27157,
 'title': 'Fix build warnings',
 'user': {'login': 'pilkibun',
  'id': 51503352,
  'node_id': 'MDQ6VXNlcjUxNTAzMzUy',
  'avatar_url': 'https://avatars1.githubusercontent.com/u/51503352?v=4',
  'gravatar_id': '',
  'url': 'https://api.github.com/users/pilkibun',
  'html_url': 'https://github.com/pilkibun',
  'followers_url': 'https://api.github.com/users/pilkibun/followers',
  'following_url': 'https://api.github.com/users/pilkibun/following{/other_user}',
  'gists_url': 'https://api.github.com/users/pilkibun/gists{/gist_id}',
  'starred_url': 'https://api.github.com/users/pilkibun/starred{/owner}{/repo}',
  'subscriptions_url': 'https://api.github.com/users/pilkibun/subscriptions',
  'organizations_url': 'https://api.github.com/users/pilkibun/orgs',
  'repos_url': 'https://api.github.com/users/pilkibun/repos',
  'events_url': 'https://api.github.com/users/pilkibun/events{/privacy}',
  'received_events_url': 'https://api.github.com/users/pilkibun/received_events',
  'type': 'User',
  'site_admin': False},
 'labels': [],
 'state': 'open',
 'locked': False,
 'assignee': None,
 'assignees': [],
 'milestone': None,
 'comments': 0,
 'created_at': '2019-07-01T01:28:08Z',
 'updated_at': '2019-07-01T02:01:36Z',
 'closed_at': None,
 'author_association': 'CONTRIBUTOR',
 'pull_request': {'url': 'https://api.github.com/repos/pandas-dev/pandas/pulls/27157',
  'html_url': 'https://github.com/pandas-dev/pandas/pull/27157',
  'diff_url': 'https://github.com/pandas-dev/pandas/pull/27157.diff',
  'patch_url': 'https://github.com/pandas-dev/pandas/pull/27157.patch'},
 'body': "Cleans up a whole bunch. Remaining offenders are:\r\n- Parsers.pyx and tokenizer. Signed/unsigned hell, made worse by python/cython/c mixing.\r\n- interval.pyx, not touched because large PR in progress in #27100.\r\n- np_datetime.c and np_datetime_strings.c. These are linked into 15+ cython modules as extra object files, but they '#include <datetime.h>`, which expects only standalone modules, who properly init to do it. Kinda painful to fix, though it means each function is compiled and kept in memory 15 times.\r\n"}

In [62]:
data[0]['title']

'Fix build warnings'

In [64]:
issues=pd.DataFrame(data,columns=['number','title','labels','state'])
issues.head()

,number,title,labels,state
0,27157,Fix build warnings,[],open
1,27156,DOC: mention that float_format can be a functi...,"[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",open
2,27155,float_format in to_latex can be a function,"[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",open
3,27154,"BUG: fix KeyError with list of a single, missi...","[{'id': 2822098, 'node_id': 'MDU6TGFiZWwyODIyM...",open
4,27153,EA: preliminary EA reshape ops,[],open

In [68]:
issues.index

RangeIndex(start=0, stop=30, step=1)

In [72]:
issues.iloc[0]['state']

'open'

数据库不太了解，待补充

In [73]:
import sqlite3